# Data Joining
Sean Wade

In [607]:
import pandas as pd
import os
import json
import numpy as np
import pandas_profiling

from matplotlib import pyplot as plt
%matplotlib inline

### Train / Test Index

In [608]:
df_train_ids = pd.read_csv('data/train_ids.csv')
df_test_ids = pd.read_csv('data/test_ids.csv')

In [609]:
df_train_ids.drop('Unnamed: 0', axis=1, inplace=True)
df_test_ids.drop('Unnamed: 0', axis=1, inplace=True)

In [610]:
df_train_ids.set_index('SK_ID_CURR', inplace=True)
df_test_ids.set_index('SK_ID_CURR', inplace=True)

### Database Data

In [611]:
df_credit_risk = pd.read_csv('data/credit_risk_features.csv')

In [612]:
df_credit_risk.drop('Unnamed: 0', axis=1, inplace=True)

In [613]:
df_credit_risk.set_index('SK_ID_CURR', inplace=True)

In [614]:
df_credit_risk.head()

,DEF_60_CNT_SOCIAL_CIRCLE,DAYS_LAST_PHONE_CHANGE,BASEMENTAREA_AVG,ENTRANCES_AVG,FLAG_DOCUMENT_20,FONDKAPREMONT_MODE,CNT_CHILDREN,FLAG_DOCUMENT_15,FLAG_EMAIL,OWN_CAR_AGE
SK_ID_CURR,,,,,,,,,,
100004,0.0,-815.0,NaN,NaN,0,NaN,0,0,0,26.0
100006,0.0,-617.0,NaN,NaN,0,NaN,0,0,0,NaN
100012,0.0,-1673.0,NaN,NaN,0,NaN,0,0,0,NaN
100014,0.0,-844.0,NaN,NaN,0,NaN,1,0,0,NaN
100015,0.0,-2396.0,NaN,NaN,0,NaN,0,0,0,NaN

In [615]:
df_credit_risk.dtypes

DEF_60_CNT_SOCIAL_CIRCLE    float64
DAYS_LAST_PHONE_CHANGE      float64
BASEMENTAREA_AVG            float64
ENTRANCES_AVG               float64
FLAG_DOCUMENT_20              int64
FONDKAPREMONT_MODE           object
CNT_CHILDREN                  int64
FLAG_DOCUMENT_15              int64
FLAG_EMAIL                    int64
OWN_CAR_AGE                 float64
dtype: object

In [616]:
df_credit_risk.isnull().sum()

DEF_60_CNT_SOCIAL_CIRCLE      347
DAYS_LAST_PHONE_CHANGE          0
BASEMENTAREA_AVG            58445
ENTRANCES_AVG               50104
FLAG_DOCUMENT_20                0
FONDKAPREMONT_MODE          68255
CNT_CHILDREN                    0
FLAG_DOCUMENT_15                0
FLAG_EMAIL                      0
OWN_CAR_AGE                 65937
dtype: int64

In [617]:
df_credit_risk.describe()

,DEF_60_CNT_SOCIAL_CIRCLE,DAYS_LAST_PHONE_CHANGE,BASEMENTAREA_AVG,ENTRANCES_AVG,FLAG_DOCUMENT_20,CNT_CHILDREN,FLAG_DOCUMENT_15,FLAG_EMAIL,OWN_CAR_AGE
count,99653.000000,100000.000000,41555.000000,49896.000000,100000.000000,100000.000000,100000.000000,100000.000000,34063.000000
mean,0.101211,-964.469220,0.088648,0.149930,0.000460,0.416790,0.001270,0.057110,12.029856
std,0.364602,826.789954,0.083451,0.100033,0.021443,0.722026,0.035615,0.232054,11.870149
min,0.000000,-4131.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,0.000000,-1576.000000,0.044300,0.069000,0.000000,0.000000,0.000000,0.000000,5.000000
50%,0.000000,-757.000000,0.076500,0.137900,0.000000,0.000000,0.000000,0.000000,9.000000
75%,0.000000,-276.000000,0.112000,0.206900,0.000000,1.000000,0.000000,0.000000,15.000000
max,6.000000,0.000000,1.000000,1.000000,1.000000,19.000000,1.000000,1.000000,91.000000

### API Data

In [618]:
df_api_page = pd.read_csv('data/api_page.csv')

In [619]:
df_api_page.drop('Unnamed: 0', axis=1, inplace=True)

In [620]:
df_api_page.rename(str.upper, axis='columns', inplace=True)

In [621]:
df_api_page.set_index('SK_ID_CURR', inplace=True)

In [622]:
df_api_page.dtypes

AMT_REQ_CREDIT_BUREAU_QRT    float64
APARTMENTS_AVG               float64
DAYS_BIRTH                     int64
EMERGENCYSTATE_MODE           object
FLAG_DOCUMENT_12                bool
FLAG_DOCUMENT_13                bool
FLAG_DOCUMENT_9                 bool
NAME_EDUCATION_TYPE           object
NAME_INCOME_TYPE              object
OBS_30_CNT_SOCIAL_CIRCLE       int64
dtype: object

In [623]:
df_api_page.head()

,AMT_REQ_CREDIT_BUREAU_QRT,APARTMENTS_AVG,DAYS_BIRTH,EMERGENCYSTATE_MODE,FLAG_DOCUMENT_12,FLAG_DOCUMENT_13,FLAG_DOCUMENT_9,NAME_EDUCATION_TYPE,NAME_INCOME_TYPE,OBS_30_CNT_SOCIAL_CIRCLE
SK_ID_CURR,,,,,,,,,,
100004,0.0,NaN,-19046,NaN,False,False,False,Secondary / secondary special,Working,0
100006,NaN,NaN,-19005,NaN,False,False,False,Secondary / secondary special,Working,2
100012,NaN,NaN,-14469,NaN,False,False,False,Secondary / secondary special,Working,2
100014,0.0,NaN,-10197,NaN,False,False,False,Higher education,Working,0
100015,0.0,NaN,-20417,NaN,False,False,False,Secondary / secondary special,Pensioner,0

### dataA

In [624]:
df_dataA = pd.read_csv('data/dataA.csv')

In [625]:
df_dataA.set_index('SK_ID_CURR', inplace=True)

In [626]:
df_dataA.dtypes

TOTALAREA_MODE       object
FLOORSMIN_AVG        object
FLOORSMIN_MODE       object
ORGANIZATION_TYPE    object
NONLIVINGAREA_AVG    object
HOUSETYPE_MODE       object
LANDAREA_AVG         object
DAYS_ID_PUBLISH       int64
ELEVATORS_AVG        object
COMMONAREA_MODE      object
dtype: object

In [627]:
df_dataA.head()

,TOTALAREA_MODE,FLOORSMIN_AVG,FLOORSMIN_MODE,ORGANIZATION_TYPE,NONLIVINGAREA_AVG,HOUSETYPE_MODE,LANDAREA_AVG,DAYS_ID_PUBLISH,ELEVATORS_AVG,COMMONAREA_MODE
SK_ID_CURR,,,,,,,,,,
100004,?,?,?,Government,?,?,?,-2531,?,?
100006,?,?,?,Business Entity Type 3,?,?,?,-2437,?,?
100012,?,?,?,Electricity,?,?,?,-3992,?,?
100014,?,?,?,Medicine,?,?,?,-738,?,?
100015,?,?,?,XNA,?,?,?,-2512,?,?

In [628]:
df_dataA.replace('?', np.nan, inplace=True)

In [629]:
df_dataA.head()

,TOTALAREA_MODE,FLOORSMIN_AVG,FLOORSMIN_MODE,ORGANIZATION_TYPE,NONLIVINGAREA_AVG,HOUSETYPE_MODE,LANDAREA_AVG,DAYS_ID_PUBLISH,ELEVATORS_AVG,COMMONAREA_MODE
SK_ID_CURR,,,,,,,,,,
100004,NaN,NaN,NaN,Government,NaN,NaN,NaN,-2531,NaN,NaN
100006,NaN,NaN,NaN,Business Entity Type 3,NaN,NaN,NaN,-2437,NaN,NaN
100012,NaN,NaN,NaN,Electricity,NaN,NaN,NaN,-3992,NaN,NaN
100014,NaN,NaN,NaN,Medicine,NaN,NaN,NaN,-738,NaN,NaN
100015,NaN,NaN,NaN,XNA,NaN,NaN,NaN,-2512,NaN,NaN

### dataB

In [630]:
df_dataB = pd.read_table('data/dataB', low_memory=False)

In [631]:
df_dataB = df_dataB[df_dataB['SK_ID_CURR'] != 'cute_cat']
df_dataB['SK_ID_CURR'] = df_dataB.SK_ID_CURR.astype(int)

In [632]:
df_dataB.set_index('SK_ID_CURR', inplace=True)

### dataB_good

In [633]:
df_dataB_good = pd.read_table('data/dataB_good', low_memory=False)

In [634]:
df_dataB_good.set_index('SK_ID_CURR', inplace=True)

In [635]:
df_dataB_good.dtypes

WEEKDAY_APPR_PROCESS_START     object
WALLSMATERIAL_MODE             object
FLAG_OWN_CAR                   object
AMT_REQ_CREDIT_BUREAU_HOUR    float64
FLAG_DOCUMENT_11                int64
REGION_POPULATION_RELATIVE    float64
NONLIVINGAPARTMENTS_AVG       float64
DAYS_EMPLOYED                   int64
CNT_FAM_MEMBERS               float64
FLAG_DOCUMENT_16                int64
dtype: object

### dataC

This was a Excel file with multiple sheets. Cleaned them in Excel and saved as 3 CSV files.

In [636]:
df_dataC_1 = pd.read_csv('data/dataC_1.csv')
df_dataC_2 = pd.read_csv('data/dataC_2.csv')
df_dataC_3 = pd.read_csv('data/dataC_3.csv')

In [637]:
df_dataC_1.set_index('SK_ID_CURR', inplace=True)
df_dataC_2.set_index('SK_ID_CURR', inplace=True)
df_dataC_3.set_index('SK_ID_CURR', inplace=True)

### dataD_1

In [638]:
df_dataD_1 = pd.read_csv('data/dataD_1.csv', encoding = "ISO-8859-1")

In [639]:
df_dataD_1.set_index('SK_ID_CURR', inplace=True)

In [640]:
df_dataD_1.dtypes

APARTMENTS_MODE              float64
FLAG_DOCUMENT_6                int64
FLAG_OWN_REALTY               object
NONLIVINGAREA_MEDI           float64
FLAG_DOCUMENT_3                int64
FLAG_DOCUMENT_4                int64
FLAG_DOCUMENT_18               int64
NAME_TYPE_SUITE               object
FLOORSMAX_MEDI               float64
AMT_REQ_CREDIT_BUREAU_DAY    float64
dtype: object

### dataD

In [641]:
df_dataD = pd.read_csv('data/dataD.csv', encoding = "ISO-8859-1")

In [642]:
df_dataD.set_index('SK_ID_CURR', inplace=True)

### dataE_1 and dataE_2

Both of these have the data so we must join them to a single dataFrame

In [643]:
df_dataE_1 = pd.read_csv('data/dataE-1.tmp')
df_dataE_2 = pd.read_csv('data/dataE-2.tmp')

In [644]:
df_dataE_1.head()

,SK_ID_CURR,FLAG_DOCUMENT_7,AMT_CREDIT,DEF_30_CNT_SOCIAL_CIRCLE,AMT_INCOME_TOTAL,LIVINGAPARTMENTS_AVG,FLAG_DOCUMENT_8,REG_REGION_NOT_WORK_REGION,OBS_60_CNT_SOCIAL_CIRCLE,YEARS_BEGINEXPLUATATION_AVG,FLOORSMAX_AVG
0,100004,0,135000.0,0.0,67500.0,NaN,0,0,0.0,NaN,NaN
1,100006,,,,,,,,,,
2,100012,,,,,,,,,,
3,100014,0,652500.0,0.0,112500.0,NaN,0,0,0.0,NaN,NaN
4,100015,,,,,,,,,,

In [645]:
df_dataE_2.head()

,SK_ID_CURR,FLAG_DOCUMENT_7,AMT_CREDIT,DEF_30_CNT_SOCIAL_CIRCLE,AMT_INCOME_TOTAL,LIVINGAPARTMENTS_AVG,FLAG_DOCUMENT_8,REG_REGION_NOT_WORK_REGION,OBS_60_CNT_SOCIAL_CIRCLE,YEARS_BEGINEXPLUATATION_AVG,FLOORSMAX_AVG
0,100004,,,,,,,,,,
1,100006,0,312682.5,0.0,135000.0,NaN,0,0,2.0,NaN,NaN
2,100012,0,405000.0,0.0,135000.0,NaN,0,0,2.0,NaN,NaN
3,100014,,,,,,,,,,
4,100015,0,148365.0,0.0,38419.155,NaN,0,0,0.0,NaN,NaN

In [646]:
df_dataE_1 = df_dataE_1[df_dataE_1['FLAG_DOCUMENT_7'] != ' ']
df_dataE_2 = df_dataE_2[df_dataE_2['FLAG_DOCUMENT_7'] != ' ']

In [647]:
df_dataE = pd.merge(df_dataE_1, df_dataE_2, how='outer', on='SK_ID_CURR')

In [648]:
df_dataE.set_index('SK_ID_CURR', inplace=True)

### dataF

In [649]:
df_dataF = pd.read_csv('data/dataF.csv')

In [650]:
df_dataF.rename(str.upper, axis='columns', inplace=True)

In [651]:
df_dataF.set_index('SK_ID_CURR', inplace=True)

In [652]:
df_dataF.dtypes

REGION_RATING_CLIENT_W_CITY        int64
EXT_SOURCE_1                     float64
DAYS_REGISTRATION                float64
EXT_SOURCE_3                     float64
LIVINGAREA_MEDI                  float64
HOUR_APPR_PROCESS_START            int64
FLOORSMIN_MEDI                   float64
FLAG_DOCUMENT_14                   int64
OCCUPATION_TYPE                   object
LANDAREA_MEDI                    float64
REGION_RATING_CLIENT_W_CITY.1      int64
EXT_SOURCE_1.1                   float64
DAYS_REGISTRATION.1              float64
EXT_SOURCE_3.1                   float64
LIVINGAREA_MEDI.1                float64
HOUR_APPR_PROCESS_START.1          int64
FLOORSMIN_MEDI.1                 float64
FLAG_DOCUMENT_14.1                 int64
OCCUPATION_TYPE.1                 object
LANDAREA_MEDI.1                  float64
dtype: object

### dataG

In [653]:
g_parts = []

for part in os.listdir('data/dataG/'):
    g_parts.append(pd.read_csv(os.path.join('./data/dataG', part)))
    
df_dataG = pd.concat(g_parts)

In [654]:
df_dataG.set_index('SK_ID_CURR', inplace=True)

In [655]:
df_dataG.dtypes

FLAG_DOCUMENT_21             int64
FLAG_PHONE                   int64
YEARS_BUILD_AVG            float64
COMMONAREA_AVG             float64
LIVE_CITY_NOT_WORK_CITY      int64
REG_CITY_NOT_LIVE_CITY       int64
LIVINGAPARTMENTS_MEDI      float64
FLAG_DOCUMENT_10             int64
FLAG_DOCUMENT_17             int64
AMT_GOODS_PRICE             object
dtype: object

### dataZ_best

Even though this is named `CSV` it is a json file.

In [656]:
with open('data/dataZ_best.csv') as f:
    dataZ_best = json.load(f)

In [657]:
df_dataZ = pd.DataFrame(dataZ_best)
df_dataZ.index = df_dataZ.index.astype(np.int64)
df_dataZ.index.name = 'SK_ID_CURR'

In [658]:
df_dataZ.dtypes

AMT_ANNUITY               float64
CODE_GENDER                object
EXT_SOURCE_2               object
FLAG_DOCUMENT_5             int64
FLAG_EMP_PHONE              int64
FLAG_WORK_PHONE             int64
IS_KAEL                   float64
LIVINGAREA_AVG            float64
NAME_FAMILY_STATUS         object
REGION_RATING_CLIENT       object
REG_CITY_NOT_WORK_CITY      int64
dtype: object

In [659]:
df_dataZ['CODE_GENDER'] = df_dataZ['CODE_GENDER'].replace('M', 1)
df_dataZ['CODE_GENDER'] = df_dataZ['CODE_GENDER'].replace('F', 0)
df_dataZ['CODE_GENDER'] = df_dataZ['CODE_GENDER'].astype(bool)

In [660]:
# remove junk value
df_dataZ['REGION_RATING_CLIENT'].iloc[0] = 2

/usr/local/lib/python3.6/site-packages/pandas/core/indexing.py:194: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [661]:
df_dataZ['REG_CITY_NOT_WORK_CITY'] = df_dataZ['REG_CITY_NOT_WORK_CITY'].astype(bool)

In [662]:
# deleted when realized this was the same as the TARGET. perfect correlation
df_dataZ.drop('IS_KAEL', axis=1, inplace=True)

In [663]:
df_dataZ.EXT_SOURCE_2 = df_dataZ.EXT_SOURCE_2.apply(lambda x : float(x[:-1]))

## Merge Data Frames

In [664]:
data_frames = [
    df_api_page, 
    df_credit_risk, 
    df_dataA, 
    df_dataB,
    df_dataC_1,
    df_dataC_2,
    df_dataC_3,
    df_dataD,
    df_dataD_1,
    df_dataE,
    df_dataF,
    df_dataG,
    df_dataZ
]

In [665]:
df = data_frames[0]
for df_sec in data_frames[1:]:
    df = pd.merge(df, df_sec, left_index=True, right_index=True, how='outer')

In [666]:
df.shape

(100000, 140)

## Fix Merge Conflicts

In [667]:
merge_conflict_cols_x = df.filter(regex=("x$")).columns.tolist()
merge_conflict_cols_y = df.filter(regex=("y$")).columns.tolist()

same_cols = []
diff_cols = []

for x_col, y_col in zip(merge_conflict_cols_x, merge_conflict_cols_y):
    conflict_num = (df[x_col] != df[y_col]).sum()
    if conflict_num > 0:
        diff_cols.append(x_col[:-2])
    else:
        same_cols.append(x_col[:-2])

In [668]:
def fix_merge_conflict(x, y):
    new_col = x.copy()
    new_col[:] = np.nan

    new_col[y.isna() & x.isna()] = np.nan # set both nans to nan
    new_col[y.notna() & x.isna()] = y[y.notna() & x.isna()]
    new_col[y.isna() & x.notna()] = x[y.isna() & x.notna()]
    return new_col

In [669]:
for col in diff_cols:
    x = df[col + '_x']
    y = df[col + '_y']
    new_col = fix_merge_conflict(x, y)
    df.drop([col + '_x', col + '_y'], axis=1, inplace=True)
    df[col] = new_col

## Standardize all Booleans

In [670]:
for col in df.filter(regex=("FLAG*")).columns.tolist():
    print(df[col].value_counts(), '\n')

False    100000
Name: FLAG_DOCUMENT_12, dtype: int64

False    99638
True       362
Name: FLAG_DOCUMENT_13, dtype: int64

False    99603
True       397
Name: FLAG_DOCUMENT_9, dtype: int64

0    99954
1       46
Name: FLAG_DOCUMENT_20, dtype: int64

0    99873
1      127
Name: FLAG_DOCUMENT_15, dtype: int64

0    94289
1     5711
Name: FLAG_EMAIL, dtype: int64

N    65933
Y    34067
Name: FLAG_OWN_CAR, dtype: int64

0    99613
1      387
Name: FLAG_DOCUMENT_11, dtype: int64

0    98998
1     1002
Name: FLAG_DOCUMENT_16, dtype: int64

0    99716
1      284
Name: FLAG_DOCUMENT_14, dtype: int64

0    99716
1      284
Name: FLAG_DOCUMENT_14.1, dtype: int64

0    99959
1       41
Name: FLAG_DOCUMENT_21, dtype: int64

0    71801
1    28199
Name: FLAG_PHONE, dtype: int64

0    99999
1        1
Name: FLAG_DOCUMENT_10, dtype: int64

0    99974
1       26
Name: FLAG_DOCUMENT_17, dtype: int64

0    98489
1     1511
Name: FLAG_DOCUMENT_5, dtype: int64

1    81965
0    18035
Name: FLAG_EMP_PHONE, dtype: int64

0    80245
1    19755
Name: FLAG_WORK_PHONE, dtype: int64

0.0    99995
1.0        5
Name: FLAG_DOCUMENT_2, dtype: int64

Nay    49967
0.0    49963
1.0       37
Yay       33
Name: FLAG_DOCUMENT_19, dtype: int64

0.0    90672
1.0     8829
Name: FLAG_DOCUMENT_6, dtype: int64

Y    69327
N    30174
Name: FLAG_OWN_REALTY, dtype: int64

1.0    70537
0.0    28964
Name: FLAG_DOCUMENT_3, dtype: int64

0.0    99492
1.0        9
Name: FLAG_DOCUMENT_4, dtype: int64

0.0    98714
1.0      787
Name: FLAG_DOCUMENT_18, dtype: int64

0    99985
1       15
Name: FLAG_DOCUMENT_7, dtype: int64

0    91832
1     8168
Name: FLAG_DOCUMENT_8, dtype: int64

In [671]:
df.drop('FLAG_DOCUMENT_12', axis=1, inplace=True)

In [672]:
df['FLAG_DOCUMENT_19'].replace('Yay', 1, inplace=True)
df['FLAG_DOCUMENT_19'].replace('Nay', 0, inplace=True)

df['FLAG_OWN_REALTY'].replace('Y', 1, inplace=True)
df['FLAG_OWN_REALTY'].replace('N', 0, inplace=True)

df['FLAG_OWN_CAR'].replace('Y', 1, inplace=True)
df['FLAG_OWN_CAR'].replace('N', 0, inplace=True)

df['FLAG_DOCUMENT_7'].replace('1', 1, inplace=True)
df['FLAG_DOCUMENT_7'].replace('0', 0, inplace=True)

df['FLAG_DOCUMENT_8'].replace('1', 1, inplace=True)
df['FLAG_DOCUMENT_8'].replace('0', 0, inplace=True)

df['EMERGENCYSTATE_MODE'].replace('Yes', 1, inplace=True)
df['EMERGENCYSTATE_MODE'].replace('No', 0, inplace=True)

In [673]:
for col in df.filter(regex=("FLAG*")).columns.tolist():
    if not df[col].isna().any():
        df[col] = df[col].astype('bool')

## Convert to Float

In [674]:
df['AMT_GOODS_PRICE'] = df['AMT_GOODS_PRICE'].apply(lambda x: float(x.replace('€', '')))

In [675]:
to_convert = [
    'AMT_CREDIT',
    'AMT_INCOME_TOTAL',
    'COMMONAREA_MODE',
    'ELEVATORS_AVG',
    'FLOORSMAX_AVG',
    'FLOORSMIN_AVG',
    'LANDAREA_AVG',
    'LIVINGAPARTMENTS_AVG',
    'NONLIVINGAREA_AVG',
    'TOTALAREA_MODE',
    "YEARS_BEGINEXPLUATATION_AVG" 
]

In [676]:
for col in to_convert:
    df[col] = df[col].astype('float')

## Remove High Correlations

Drop all features with correlation greater than .9

In [677]:
to_remove = [
     'APARTMENTS_MODE',
     'AMT_CREDIT',
     'COMMONAREA_AVG',
     'DAYS_REGISTRATION.1',
     'EXT_SOURCE_1.1',
     'EXT_SOURCE_3.1',
     'FLAG_DOCUMENT_14.1',
     'FLOORSMAX_AVG',
     'FLOORSMAX_MEDI',
     'FLOORSMIN_MEDI',
     'FLOORSMIN_MEDI.1',
     'HOUR_APPR_PROCESS_START.1',
     'LANDAREA_MEDI',
     'LANDAREA_MEDI.1',
     'LIVINGAREA_MEDI.1',
     'NONLIVINGAPARTMENTS_MEDI',
     'NONLIVINGAREA_MEDI',
     'REGION_RATING_CLIENT_W_CITY.1',
     'LIVINGAPARTMENTS_AVG',
     'LIVINGAPARTMENTS_MEDI',
     'LIVINGAREA_MEDI'
]

In [678]:
df.drop(to_remove, axis=1, inplace=True)

Possible TODO, check hugh correlations for exact matches with some extra data

## Pandas Profiling

In [679]:
profile = pandas_profiling.ProfileReport(df)
profile.to_file(outputfile="profile.html")

## Break to Train/Test

In [680]:
# break into test-train datasets
df_train = df_train_ids.join(df)
df_test = df_test_ids.join(df)
df_test.drop('TARGET', axis=1, inplace=True)

In [682]:
df_train.to_csv('clean_data/train_merge.csv')
df_test.to_csv('clean_data/test_merge.csv')